
import logging
logging.basicConfig(format='%(asctime)s - %(filename)s[%(lineno)d] - %(levelname): %(message)s', level=logging.DEBUG)

# 岛屿数量  中等
# 给一个01矩阵, 1代表是陆地, 0代表海洋, 如果两个1相邻, 那么这两个1属于同一个岛, 我们只考虑上下左右为相邻.
# 岛屿: 相邻陆地可以组成一个岛屿(相邻: 上下左右)判断岛屿个数.
# 例如: 输入 [[1,1,0,0,0],[0,1,0,1,1],[0,0,0,1,1],[0,0,0,0,0],[0,0,1,1,1]]对应的输出为3
# 注: 存储的01数据其实是字符'0','1'
# 备注: 01矩阵范围<=200*200
# 示例一: 输入[[1,1,0,0,0],[0,1,0,1,1],[0,0,0,1,1],[0,0,0,0,0],[0,0,1,1,1]], 返回值为3
# 示例二: 输入[[0]], 返回值为0
# 示例三: 输入[[1,1],[1,1]], 返回值为1

def demo():
    arr = []

if __name__ == '__main__':
    demo()