
import logging
logging.basicConfig(format='%(asctime)s - %(filename)s[%(lineno)d] - %(levelname)s:%(message)s', level=logging.DEBUG)

# 判断是不是完全二叉树 中等
# 给定一个二叉树，确定他是否是一个完全二叉树。
# 完全二叉树的定义：若二叉树的深度为 h，除第 h 层外，其它各层的结点数都达到最大个数，第 h 层所有的叶子结点都连续集中在最左边，这就是完全二叉树。（第 h 层可能包含 [1~2h] 个节点）
# 数据范围：节点数满足 1 <= n <= 100
# 样例图1：[1, 2, 3, 4, 5, 6], 样例图2：[1, 2, 3, 4, 5, 6, 7], 样例图3：[1, 2, 3, 4, 5, #, 6]
# 示例1: 输入：{1,2,3,4,5,6}, 返回值：true
# 示例2: 输入：{1,2,3,4,5,6,7}, 返回值：true
# 示例3: 输入：{1,2,3,4,5,#,6}, 返回值：false

def demo():
    arr = []

if __name__ == '__main__':
    demo()