
import logging
logging.basicConfig(format='%(asctime)s - %(filename)s[%(lineno)d] - %(levelname)s:%(message)s', level=logging.DEBUG)

# 输出二叉树的右视图 中等
# 请根据二叉树的前序遍历，中序遍历恢复二叉树，并打印出二叉树的右视图
# 数据范围：0 <= n <= 10000
# 要求：空间复杂度O(n), 时间复杂度O(n)
# 如输入[1,2,4,5,3],[4,2,5,1,3]时，通过前序遍历的结果[1,2,4,5,3]和中序遍历的结果[4,2,5,1,3]可重建出以下二叉树：
# [1, 2, 3, 4, 5], 所以对应的输出为[1,3,5]。
# 示例1: 输入：[1,2,4,5,3],[4,2,5,1,3], 返回值：[1,3,5],
# 备注：二叉树每个节点的值在区间[1,10000]内，且保证每个节点的值互不相同。

def demo():
    arr = []

if __name__ == '__main__':
    demo()