
import logging
logging.basicConfig(format='%(asctime)s - %(filename)s[%(lineno)d] - %(levelname)s:%(message)s', level=logging.DEBUG)

# 链表的奇偶重排 中等
# 给定一个单链表，请设定一个函数，将链表的奇数位节点和偶数位节点分别放在一起，重排后输出。
# 注意是节点的编号而非节点的数值。
# 数据范围：节点数量满足 0 <= n <= 10^5, 节点中的值都满足 0 <= val <= 1000
# 要求：空间复杂度O(n), 时间复杂度O(n)
# 示例1: 输入：{1,2,3,4,5,6}, 返回值：{1,3,5,2,4,6}, 说明：1->2->3->4->5->6->NULL, 重排后为 1->3->5->2->4->6->NULL
# 示例2: 输入：{1,4,6,3,7}, 返回值：{1,6,7,4,3}, 说明：1->4->6->3->7->NULL, 重排后为 1->6->7->4->3->NULL
# 奇数位节点有1,6,7，偶数位节点有4,3。重排后为1,6,7,4,3
# 备注：链表长度不大于200000。每个数范围均在int内。

def demo():
    arr = []

if __name__ == '__main__':
    demo()